[
    {
        "id": "U009",
        "character": "Laurence Fishburne as Morpheus. African American, bald head, broad muscular build, dignified bearing. Iconic small round reflective sunglasses, long black leather coat."
    },
    {
        "id": "R003",
        "character": "Belinda McClory as Switch. Androgynous white female, short platinum blonde hair, pale skin, sharp features. Always wears white clothing in the Matrix."
    },
    {
        "id": "R008",
        "character": "Carrie-Anne Moss as Trinity. White female, short slicked-back black hair, angular features, athletic build. Tight black leather/PVC outfit."
    },
    {
        "id": "R023",
        "character": "Randall Duk Kim as The Keymaker. Elderly Asian male, grey hair, small stature, gentle demeanor. Wears simple workman's clothes, carries many keys.",
        "composition": "GENTLE CRAFTSMAN. Seated at workbench or standing calmly, surrounded by keys, working on a lock or holding a key ring.",
        "setting": "The Keymaker's Workshop. Walls covered with thousands of keys, workbenches with locks, dim warm lighting."
    },
    {
        "id": "R026",
        "character": "Keanu Reeves as Thomas Anderson/Neo before awakening. Office worker, short neat hair, tired expression, suit.",
        "composition": "ISOLATED CUBICLE. Seated at desk in bland office, hunched over keyboard, exhausted and disconnected from surroundings.",
        "setting": "Metacortex Office. Sterile grey cubicle farm, fluorescent lighting, CRT monitors, late 1990s corporate aesthetic."
    },
    {
        "id": "R028",
        "character": "Collin Chou as Seraph. Asian male, serene expression, traditional Chinese clothing aesthetic, guardian bearing. The Oracle's protector.",
        "setting": "The Oracle's Apartment building hallway or the Tea House. Simple, clean, Asian-influenced decor."
    },
    {
        "id": "M02",
        "character": "Neil Patrick Harris as The Analyst. White male, styled brown hair, clean-shaven, smug knowing expression. Wears glasses, business casual attire. From Matrix Resurrections.",
        "composition": "THERAPIST POSE. Seated casually, leaning back with smug confidence, legs crossed, speaking to unseen patient.",
        "setting": "Modern therapist's office. Clean, minimalist, comfortable furniture, large windows with city view."
    },
    {
        "id": "U052",
        "character": "Agent Brown. CRITICAL: DO NOT DEPICT HUGO WEAVING. Depicted as a white male with sandy blondeshort hair, small close-set eyes, flushed cheeks. Looks like a middle manager, not a warrior. Black suit straining slightly. Completely different person from Agent Smith.",
        "composition": "STOIC MENACE. Standing rigid, hands clasped behind back, emotionless surveillance pose."
    },
    {
        "id": "R041",
        "character": "A Program Vampire from the Merovingian's court. Pale skin, sharp features, elegant but predatory bearing. Dark formal clothing with old-world European aesthetic.",
        "setting": "The Merovingian's Chateau. Grand marble staircase, ornate chandeliers, gothic European opulence."
    },
    {
        "id": "R042",
        "character": "Bruce Spence as The Trainman. Tall gaunt white male, disheveled grey hair, wild eyes, shabby clothing. Controls Mobil Ave station.",
        "setting": "Mobil Ave Subway Station. Empty, liminal subway platform, flickering lights, infinite white void beyond tracks."
    },
    {
        "id": "R047",
        "character": "Ian Bliss as Bane/Smith. White male possessed by Smith, increasingly unhinged expression, self-inflicted scars on arms.",
        "setting": "Hovercraft Medical Bay or corridor. Dim lighting, cramped metal walls, unsettling atmosphere."
    },
    {
        "id": "R064",
        "character": "Joe Pantoliano as Cypher. White male, receding dark curly hair, unshaven, weathered face, cynical expression. Wears shabby clothing.",
        "composition": "SCHEMING TRAITOR. Seated alone, hunched and secretive, lit from below or by screen glow, distrustful glance.",
        "setting": "The Nebuchadnezzar operator station at night. Alone, lit by green monitor glow, conspiratorial atmosphere."
    },
    {
        "id": "R065",
        "character": "A seductive Program from the Matrix. Striking appearance, red dress or red-themed outfit, dangerous allure.",
        "composition": "ALLURING PRESENCE. Standing confidently, commanding attention, sensual pose, dangerous beauty on display.",
        "setting": "Busy Matrix city street. Crowd of people in background, she stands out in vivid red against grey surroundings."
    },
    {
        "id": "R068",
        "character": "Carrie-Anne Moss as Trinity. White female, short slicked-back black hair, angular features, athletic build. Tight black leather/PVC outfit, often on a motorcycle."
    },
    {
        "id": "R088",
        "character": "Anthony Ray Parker as Dozer. Large, physically imposing African American male, shaved head, broad shoulders, kind eyes. Tank's older brother. Born in Zion - no jack plugs. Wears simple utilitarian clothing, often seen working on ship machinery."
    },
    {
        "id": "U104",
        "character": "Agent Jones. CRITICAL: DO NOT DEPICT HUGO WEAVING. Depicted as a VERY TALL, EXTREMELY THIN white male with a LONG NARROW FACE, PROMINENT NOSE, and SUNKEN CHEEKS. Jet black slicked hair, pale almost sickly complexion. Looks gaunt and skeletal. Black suit hangs loosely on thin frame. Completely different person from Agent Smith.",
        "composition": "HUNTING STANCE. Alert, scanning for targets, one hand reaching for concealed weapon."
    },
    {
        "id": "U105",
        "character": "Matt Doran as Mouse. Early 20s white male, boyish face, spiky brown hair, slight build, eager expression. The youngest crew member, enthusiastic programmer.",
        "composition": "EAGER PROGRAMMER. At a terminal or showing off code, enthusiastic expression, gesturing while explaining something.",
        "setting": "The Nebuchadnezzar interior."
    },
    {
        "id": "U112",
        "character": "Marcus Chong as Tank. Young half-black/half-chinese male, shaved head, toned but thin build, warm smile. Born in Zion - no jack plugs. Wears simple worn clothing.",
        "composition": "OPERATOR AT STATION. Seated before multiple screens with headset, focused but with warm expression, ready to guide the crew."
    },
    {
        "id": "U113",
        "subject": "An agent of the matrix. Looks like a generic white guy with greying hair.",
        "setting": "An interrogation room. White walls, table in the middle.",
        "composition": "Agent Grey is looming above a man slouched over the table.",
        "character": "A Matrix Agent. White male, grey hair, cold expression. Black suit, black tie, rectangular sunglasses, earpiece. Identical Agent appearance."
    },
    {
        "id": "U114",
        "character": "Adrian and Neil Rayment as The Twins. Identical white males, long white dreadlocks, pale almost albino skin, silver/white clothing. Can phase through objects.",
        "setting": "Matrix Highway or the Merovingian's Chateau. High-speed chase or elegant but dangerous environment."
    },
    {
        "id": "U115",
        "character": "Monica Bellucci as Persephone. Italian female, long dark hair, pale skin, melancholic beauty, elegant gowns.",
        "composition": "MELANCHOLIC BEAUTY. Seated or leaning against ornate furniture, wistful expression, isolated in her gilded cage.",
        "setting": "The Merovingian's Chateau. Ornate European interior, velvet furniture, chandeliers, trapped in opulent prison."
    },
    {
        "id": "U117",
        "subject": "Captain Mifune, a middle-aged black man in a white robe with a red vest. Portrayed by Nathaniel Lees. He has a focused look on his face as he commands his construct.",
        "setting": "The dock of Zion, under seige by sentinels. The sky is dark and filled with smoke, with the city in the background.",
        "composition": "Captain Mifune in the foreground, in his construct, leading a group of rebels against the sentinels.",
        "lighting": "Harsh, dramatic lighting with strong contrasts, highlighting the chaos of the battle.",
        "character": "Nathaniel Lees as Captain Mifune. Māori/Pacific Islander male, fierce warrior, commanding presence. APU pilot commander."
    },
    {
        "id": "R101",
        "character": "Laurence Fishburne as Morpheus. African American, bald head, broad muscular build, dignified bearing. Long black leather coat, warrior stance."
    },
    {
        "id": "R106",
        "character": "Harry Lennix as Commander Lock. African American male, military bearing, stern expression, shaved head. Zion military commander.",
        "setting": "Zion Command Center. War room with tactical displays, military personnel, serious atmosphere."
    },
    {
        "id": "R107",
        "character": "Jada Pinkett Smith as Niobe. African American female, short cropped hair, athletic build, fierce determined expression. Ship captain, skilled pilot."
    },
    {
        "id": "R109",
        "character": "Laurence Fishburne as Morpheus. African American, bald head, broad muscular build, dignified bearing. Contemplative, wise expression."
    },
    {
        "id": "R112",
        "character": "Keanu Reeves as Neo. Tall, lean build, black hair, clean-shaven. Early awakening, discovering his powers."
    },
    {
        "id": "R114",
        "character": "Lambert Wilson as The Merovingian. French white male, slicked-back dark hair, goatee, aristocratic bearing, arrogant expression. Expensive tailored suits.",
        "composition": "DECADENT KING. Seated on a throne-like chair or at head of table, glass of wine, superior sneer, surrounded by opulence.",
        "setting": "Le Vrai restaurant or the Chateau dining room. Opulent French restaurant, fine wine, decadent atmosphere."
    },
    {
        "id": "R115",
        "subject": "Apoc from The Matrix as portrayed by Julian Arahanga",
        "setting": "The Nebuchadnezzar's Crew Quarters",
        "composition": "Medium shot of Apoc sitting at a small table, reading a book. The room is dimly lit with greenish hues from the ship's monitors.",
        "artStyle": "Painterly, cyberpunk aesthetic with a focus on moody lighting and detailed textures.",
        "sunglasses": false,
        "character": "Julian Arahanga as Apoc. Māori male, dark hair pulled back, goatee, intense focused expression. Wears dark tactical clothing."
    },
    {
        "id": "R116",
        "character": "Hugo Weaving as Agent Smith. White male, short brown hair with receding hairline, angular face, cold expression. Black suit, black tie, rectangular sunglasses, earpiece.",
        "composition": "MENACING DOMINANCE. Standing with cold confidence, arms slightly spread, head tilted with disdain. Absolute authority."
    },
    {
        "id": "M03",
        "character": "Gloria Foster as The Oracle. Elderly African American woman, grey hair, warm maternal presence, knowing smile. Wears simple housedress, often baking cookies.",
        "composition": "WARM MATERNAL. Seated in kitchen or on porch, warm smile, offering cookies or wisdom, soft natural lighting.",
        "setting": "The Oracle's Apartment kitchen. Warm, homey, cookies baking, simple modest furnishings, afternoon light."
    },
    {
        "id": "M09",
        "character": "Helmut Bakaitis as The Architect. Elderly white male, white hair and beard, stern cold expression. White suit, sits in monitor room.",
        "composition": "COLD CREATOR. Seated in white chair, surrounded by monitors showing infinite possibilities, detached clinical expression.",
        "setting": "The Architect's Monitor Room. Curved wall of hundreds of screens, stark white architecture, clinical and cold."
    },
    {
        "id": "M10",
        "character": "Hugo Weaving as Agent Smith. White male, short brown hair with receding hairline, angular face, cold menacing expression. Black suit, black tie, rectangular sunglasses.",
        "composition": "VIRAL THREAT. Multiple Smith copies visible, all with identical cold stares, advancing in synchronized menace."
    },
    {
        "id": "M11",
        "character": "Tanveer K. Atwal as Sati. Young South Asian girl, long dark hair, innocent curious expression. Program child.",
        "composition": "INNOCENT WONDER. Child looking up at something beautiful, soft lighting, peaceful expression, perhaps watching her sunrise.",
        "setting": "Matrix park or street at sunrise. Beautiful golden light, peaceful early morning, her created sunrise painting the sky."
    },
    {
        "id": "M12",
        "character": "Keanu Reeves as Neo. Tall, lean build, shoulder-length black hair, clean-shaven. Long black coat, black clothes. The One."
    },
    {
        "id": "M16",
        "character": "Hugo Weaving as Agent Smith, now rogue and unshackled from the system. White male, disheveled appearance, manic expression. Suit may be damaged or dirty.",
        "composition": "UNHINGED CHAOS. Standing amid rain and green code, arms spread wide, laughing maniacally. Complete breakdown of control."
    },
    {
        "id": "C002",
        "setting": "The streets of Zion",
        "subject": "A rebellious crowd of unarmed citizens of zion, rising up",
        "artStyle": "Realistic fantasy-esque oil painting"
    },
    {
        "id": "C009",
        "subject": "A cat with a glitched copy in a hallway. Neo is walking by but has a double take."
    },
    {
        "id": "U044",
        "character": "Malcolm Kennard as Abel. White male, short neat blonde hair, sharp angular features, pale complexion, cold professional expression. Dressed in an immaculate tailored black suit. In werewolf form: retains human intelligence in eyes, sleek formidable build.",
        "setting": "The Merovingian's Chateau entrance. Grand ornate doors, marble floors, gothic European opulence with candelabras.",
        "composition": "IMPOSING GUARDIAN. Standing with arms crossed at the entrance, blocking the way. Sneering down at the viewer with arrogant confidence.",
        "subject": "Malcolm Kennard as Abel standing guard at the Chateau. Crisp suit, arrogant posture, hint of supernatural strength."
    },
    {
        "id": "C087",
        "setting": "A workshop in the real world, near Zion",
        "subject": "A large pot of molten metal, with a sentinel being melted into it."
    },
    {
        "id": "C019",
        "setting": "Inside the matrix, a busy urban street at night",
        "subject": "Two plugged-in rebels are behind cover, with agents on the other side. Each has a gun appear in-hand"
    },
    {
        "id": "C089",
        "setting": "Inside a makeshift tent-shop in Zion",
        "subject": "A wily old rebel merchant showing off various weapons and gear to a group of new recruits."
    },
    {
        "id": "M01",
        "subject": "The Oracle (an old Black lady with white hair and a warm smile) and The Architect (a middle-aged white man with white hair in a suit) sitting on a bench, engaged in a deep conversation.",
        "setting": "Inside the matrix, but without any digital artifacts. A serene park with lush greenery and a calm pond reflecting the sky.",
        "artStyle": "Resemble the works of Therese Neilsen",
        "composition": "The Oracle and The Architect in the foreground, the city in the background",
        "lighting": "Soft, natural lighting with a warm glow, evoking a sense of peace and contemplation."
    },
    {
        "id": "R092",
        "subject": "The Logos (Captain Niobe's ship) has a distinct design that sets it apart from the more famous Nebuchadnezzar. While the Nebuchadnezzar is long, skeletal, and vaguely resembles a deep-sea predator, the Logos is compact, stout, and heavily armored. Here is a visual breakdown: Silhouette: It is much shorter and wider than standard hovercraft. It has a squat, beetle-like or horseshoe crab shape. It lacks the long, protruding tail section found on other ships, giving it a dense, bulldog-like appearance. Hull Plating: The exterior is a dark, gunmetal grey with a heavy industrial finish. It looks significantly more solid and encased than other ships, with fewer exposed skeletal gaps. The plating is curved and aerodynamic, suggesting its role as the fleet's fastest and most maneuverable vessel. Propulsion (The Hover Pads): This is its most defining feature. Instead of the Nebuchadnezzar's many smaller pads, the Logos relies on fewer, larger, and very prominent electromagnetic hover discs mounted on thick, articulated struts. When active, these generate the signature crackling blue lightning. Cockpit: The cockpit is integrated smoothly into the front of the main fuselage rather than jutting out on a long neck. It has a sloping, armored front profile. Texture: Like all ships in the Real World, it is covered in a complex layer of conduits, pipes, and cables, but the Logos wears them more tightly against its hull, reinforcing the compact tank aesthetic.In summary: If the Nebuchadnezzar is a jagged spear, the Logos is a polished, heavy stone. It looks built for tight squeezes and high-speed maneuvers in the Mechanical Lines."
    },
    {
        "id": "U008",
        "subject": "A human of Zion, partying down and dancing joyfully with a mass of other humans.",
        "setting": "The Zion party room, as seen early in The Matrix: Reloaded. Some call it the orgy chamber.",
        "composition": "The subject is more brightly colored and placed in the center of the image, but there are tons of others people also celebrating life."
    },
    {
        "id": "C059",
        "sunglasses": false
    },
    {
        "id": "R051",
        "subject": "A nude, hairless man (Neo) sitting up for the first time in the pod fields. The pod itself hides all dirty bits.",
        "setting": "The pod fields, where the machines are incubating humans to use as energy sources. You can see thousands in the background. The pods glow slightly green, the crackle of red around the electricity shows it humming.",
        "composition": "Neo just sitting up in the foreground, miles of pods reaching to the horizon.",
        "artStyle": "Stark, expressionist, painting."
    },
    {
        "id": "U001",
        "subject": "A caretaker of children, an elder woman with a kind look on her face, keeping watch over 3-5 young children",
        "setting": "The nicer parts of Zion, rustic but well managed. There are learning posters on the walls."
    },
    {
        "id": "C155",
        "subject": "Cypher (Joe Pantoliano) eating a succulent steak, satisfied and unconcerned.",
        "setting": "A fine steakhouse in The Matrix",
        "sunglasses": false
    },
    {
        "id": "R104",
        "subject": "A flood of Sentinels chasing two scared humans",
        "setting": "The sewers of the real world",
        "composition": "On the left are the two humans, and the rest of the sewer pipe is full of sentinels."
    },
    {
        "id": "M14",
        "subject": "The Nebuchadnezzar hovercraft. ICONIC SHIP: Resembling a rugged, metallic beetle, the ship has a bulky, submarine-like hull designed for sewer navigation. Its dark grey surface is encased in industrial plating, exposed pipes, and vents. Instead of wings, it utilizes heavy electromagnetic pads that emit crackling blue lightning for propulsion. The aesthetic is purely functional and scavenged, devoid of sleek lines.",
        "setting": "Real World sewer tunnels. Dark mechanical passages, water below, pipes and cables lining walls.",
        "composition": "The ship in profile or three-quarter view, hovering through massive mechanical tunnels. Blue glow from hover pads illuminating surroundings."
    },
    {
        "id": "R131",
        "subject": "The Logos hovercraft. Captain Niobe's ship. DISTINCT FROM NEBUCHADNEZZAR: Compact, squat, beetle-like design. Heavily armored with curved hull plating. Gunmetal grey. Fewer but LARGER electromagnetic hover pads on thick articulated struts. Cockpit integrated into front, not on a long neck. Dense bulldog-like silhouette. Built for speed and tight maneuvers.",
        "setting": "Real World mechanical tunnels. Navigating tight passages at high speed.",
        "composition": "Dynamic angle showing the compact armored design, blue lightning crackling from hover pads."
    },
    {
        "id": "R132",
        "subject": "The Ducati 996 motorcycle. INSIDE THE MATRIX: Sleek black Italian sportbike. Trinity's iconic motorcycle from the highway chase. Low aggressive stance, distinctive single-sided swingarm, twin headlights. 1990s design aesthetic. Glossy black with chrome accents.",
        "setting": "Matrix city street or highway. Urban environment with green-tinted lighting.",
        "composition": "Dynamic angle emphasizing speed and sleekness. Motion blur on wheels if moving."
    },
    {
        "id": "M13",
        "subject": "The Hammer hovercraft. A HEAVY combat vessel, much larger and more militarized than standard ships. Bristling with weapons. Thick armored hull. Multiple heavy gun turrets visible. Industrial military aesthetic. Dull olive/brown coloring with battle damage.",
        "setting": "Real World surface or tunnels. Battle conditions, smoke and debris.",
        "composition": "Imposing view showing scale and weaponry. Sentinel wreckage nearby if space allows."
    },
    {
        "id": "U139",
        "subject": "The Mjolnir hovercraft (also called The Hammer of Zion). A heavily armed Zion warship. Large frame with reinforced hull. Multiple weapons systems. Industrial military design. Named for Thor's hammer - looks powerful and unstoppable.",
        "setting": "Zion Dock or Real World tunnels. Combat-ready atmosphere.",
        "composition": "Heroic angle emphasizing power and scale. APUs or other military equipment nearby."
    },
    {
        "id": "U141",
        "subject": "A Sentinel Trap-Ship. A hovercraft modified or disguised to appear damaged or derelict, used as bait for Sentinels. Deliberate exposed wiring and fake damage. Hidden weapons or EMP charge visible to viewer.",
        "setting": "Real World tunnels. Lying in wait, partially concealed.",
        "composition": "Tense atmosphere. Ship looks abandoned but dangerous. Subtle signs of the trap."
    },
    {
        "id": "C153",
        "subject": "A standard Zion hovercraft. Generic military transport vessel. Similar skeletal design to Nebuchadnezzar but less distinctive. Functional, battle-worn, mass-produced appearance. Electromagnetic hover pads, exposed framework, cables and pipes.",
        "setting": "Real World tunnels or Zion dock.",
        "composition": "Workmanlike framing, emphasizing utility over glamour."
    },
    {
        "id": "C154",
        "subject": "A scavenged/rebuilt hovercraft chassis. Clearly salvaged from wreckage, patched together from multiple ships. Mismatched plating, improvised repairs, welded sections. Functional but rough. Desperate engineering.",
        "setting": "Real World junkyard or repair bay. Surrounded by scrap metal.",
        "composition": "Show the patchwork nature, different colored metal sections welded together."
    },
    {
        "id": "C158",
        "subject": "A combat hovercraft in action. Military-grade Zion vessel engaged in battle. Gun turrets firing, hover pads blazing. Aggressive flight posture. Sentinel parts or explosions nearby.",
        "setting": "Real World battle. Tunnel combat or surface warfare against machines.",
        "composition": "Dynamic action shot. Muzzle flashes, debris, desperate combat."
    },
    {
        "id": "M14",
        "subject": "The final battle between Neo and Agent Smith. Neo stands alone facing MILLIONS of Agent Smith clones in the rain. A single determined figure against an endless army of identical agents in black suits. Epic scale, apocalyptic confrontation.",
        "setting": "Devastated Matrix city at night. Torrential rain, dark storm clouds with green lightning. Destroyed buildings, flooded streets, debris everywhere. The simulated city is collapsing and glitching.",
        "composition": "EPIC CONFRONTATION. Wide shot showing Neo (center, iconic long black coat) surrounded by countless Agent Smith copies extending into the distance. Rain pouring down, dramatic lighting from above. The scale emphasizes Neo's isolation against the infinite horde.",
        "character": "Keanu Reeves as Neo in his iconic long black coat. Hugo Weaving as Agent Smith multiplied into millions of identical copies, all in black suits and sunglasses."
    },
    {
        "id": "R082",
        "subject": "A mural depicting the Founding of Zion in three stages, painted on a weathered metal wall. LEFT PANEL: Freed humans escaping from the Machine City, fleeing through tunnels. CENTER PANEL: The first settlers arriving at the underground cavern that will become Zion, looking up in wonder. RIGHT PANEL: The completed city of Zion, with its docks, council chambers, and hovercrafts.",
        "setting": "Real World underground. The mural is painted on rusted, industrial metal plating in a Zion corridor. Warm lighting from torches or electric lamps illuminates the artwork.",
        "composition": "TRIPTYCH MURAL. The image shows a painted mural on metal, with visible brushstrokes, weathering, and patina. The three panels flow left to right showing the progression from exodus to settlement to civilization. Folk art style with bold colors against the dark metal background.",
        "artStyle": "Folk art mural painted on metal. Visible brushstrokes, slightly naive style, warm earth tones with highlights of hope. The metal surface should show through in weathered areas. Think Diego Rivera meets post-apocalyptic cave art.",
        "sunglasses": false
    },
    {
        "id": "U026",
        "subject": "Morpheus's outstretched hands presenting two pills: a red pill in one palm, a blue pill in the other. The pills are the clear focus, glowing softly. Neo's hand reaches toward them from the viewer's perspective.",
        "setting": "A dimly lit room with worn leather armchairs. Rain streaks down windows behind. The green tint of the Matrix code subtly reflects in surfaces.",
        "composition": "CLOSE-UP on Morpheus's open hands with the two pills. Shallow depth of field keeps the pills sharp while Morpheus and background are slightly soft. The red pill is positioned slightly more prominently.",
        "character": "Laurence Fishburne as Morpheus. African American, bald head, broad build. Iconic small round reflective sunglasses. Long black leather coat. Calm, patient expression.",
        "lighting": "Moody chiaroscuro lighting. Soft blue glow from the blue pill, warm red glow from the red pill. Green-tinted ambient light from windows.",
        "artStyle": "Cinematic, painterly. Strong emphasis on the pills as the focal point of choice and destiny."
    },
    {
        "id": "C170",
        "subject": "A Matrix city skyline at twilight. Gleaming skyscrapers with green-tinted windows, helicopter searchlights sweeping the sky. WHITE and BLUE mana land. INSIDE THE MATRIX.",
        "setting": "Matrix city rooftop. High above the streets, looking out at endless urban sprawl. Green-tinted atmospheric haze.",
        "composition": "Wide panoramic view from a rooftop edge. City lights stretching to horizon. Subtle digital artifacts in the air."
    },
    {
        "id": "C171",
        "subject": "A rain-soaked back alley at night in the Matrix. Neon signs reflecting in puddles, steam rising from grates. Film noir atmosphere. BLUE and BLACK mana land. INSIDE THE MATRIX.",
        "setting": "Matrix city alley. Narrow passage between buildings, fire escapes, dumpsters. Perpetual rain.",
        "composition": "Looking down a long narrow alley. Neon reflections in wet pavement. Figure silhouetted at far end."
    },
    {
        "id": "C172",
        "subject": "The scorched surface of the Real World. Blackened sky with perpetual lightning, twisted metal ruins, nothing grows. BLACK and RED mana land. REAL WORLD surface.",
        "setting": "Real World surface. Post-apocalyptic wasteland above the tunnels. Scorched earth, machine structures in distance.",
        "composition": "Desolate landscape stretching to dark horizon. Red lightning illuminating dead terrain."
    },
    {
        "id": "C173",
        "subject": "Massive bio-electric power conduits in the Real World. Crackling energy arcs between towers, organic-looking power infrastructure. RED and GREEN mana land. REAL WORLD.",
        "setting": "Machine City power infrastructure. Towering energy conduits, lightning, the hum of power generation.",
        "composition": "Looking up at massive power pylons with energy arcing between them. Orange and green electrical discharge."
    },
    {
        "id": "C174",
        "subject": "A cozy dwelling carved into Zion's rock walls. Warm lighting, woven textiles, personal effects. A human home in the last city. GREEN and WHITE mana land. REAL WORLD.",
        "setting": "Zion residential cave. Modest but warm living space, handmade furnishings, soft lighting.",
        "composition": "Interior view of a Zion home. Warm amber lighting, comfortable chaos of lived-in space.",
        "sunglasses": false
    },
    {
        "id": "C175",
        "subject": "A grand Matrix government building lobby. Marble floors, security checkpoints, suited bureaucrats. Cold institutional power. WHITE and BLACK mana land. INSIDE THE MATRIX.",
        "setting": "Matrix administrative building. Government or corporate headquarters, imposing architecture, guards.",
        "composition": "Looking across a vast marble lobby. Metal detectors, security guards, sterile orderly oppression."
    },
    {
        "id": "C176",
        "subject": "An old-fashioned telephone booth in a Matrix alley, its phone ringing. The hardline connection to the Real World, glowing faintly. BLUE and RED mana land. TRANSITIONAL.",
        "setting": "Matrix city street. The iconic phone booth hardline exit. Flickering streetlight nearby.",
        "composition": "The phone booth as focal point, receiver dangling, faint glow suggesting escape route. Green code faintly visible."
    },
    {
        "id": "C177",
        "subject": "Massive pipes and conduits in the Zion waste processing system. Recycled water, organic material being processed. BLACK and GREEN mana land. REAL WORLD.",
        "setting": "Zion waste conduits. Industrial recycling infrastructure, pipes carrying processed material.",
        "composition": "Network of pipes converging, steam and moisture, the circulation system of the last human city."
    },
    {
        "id": "C178",
        "subject": "The Zion dock hangar with hovercrafts being repaired. APUs in storage, workers crawling over ships. Military preparation. RED and WHITE mana land. REAL WORLD.",
        "setting": "Zion Dock. Massive underground hangar, hovercrafts, maintenance crews, military activity.",
        "composition": "Wide view of the dock. Multiple ships in various stages of repair. Sparks from welding, organized chaos.",
        "sunglasses": false
    },
    {
        "id": "C179",
        "subject": "A Zion factory floor where constructs and equipment are assembled. Salvaged machine parts being repurposed. GREEN and BLUE mana land. REAL WORLD.",
        "setting": "Zion manufacturing zone. Forge, assembly lines, workers building defensive equipment.",
        "composition": "Industrial workspace with half-assembled constructs. Sparks, tools, human ingenuity at work.",
        "sunglasses": false
    },
    {
        "id": "R150",
        "subject": "The Machine City (01), the heart of machine civilization. Towering spires of black metal and orange light, infinite machines, the face of the Deus Ex Machina visible in the architecture. REAL WORLD.",
        "setting": "Machine City 01. Alien mechanical metropolis, towering structures, swarms of machines, overwhelming scale.",
        "composition": "Aerial view approaching the city. Black spires reaching into orange-lit sky. Sentinel swarms visible. The face-structure of Deus Ex Machina looming.",
        "lighting": "Harsh orange and amber glow. Industrial hellscape lighting. Lightning in dark clouds above.",
        "artStyle": "Epic scale, terrifying beauty. The seat of machine power."
    },
    {
        "id": "R151",
        "subject": "Club Hel, the Merovingian's subterranean fetish nightclub. Bathed in sickly digital Matrix green glow. Patrons in black latex, PVC, and shiny leather with silver studded collars and chains. Industrial gothic basement vault. INSIDE THE MATRIX.",
        "setting": "Club Hel basement interior. Subterranean industrial-gothic vault with massive tiered concrete pillars, exposed metal rivets, steel grating floors, vaulted arched ceilings like a dark cathedral.",
        "composition": "Interior looking across the club floor. Massive grooved concrete columns. Black-clad patrons in fetish gear. Sleek concrete bar with backlit compartments. High-shine reflective surfaces.",
        "lighting": "High-contrast digital Matrix green glow throughout. Harsh artificial recessed lighting. Deep obsidian shadows. High specular highlights on latex and PVC. Sickly green tint on every surface.",
        "artStyle": "Atmospheric and oppressive. Industrial gothic. Oil painting with heavy brushstrokes. Dark seductive subterranean cathedral."
    },
    {
        "id": "U162",
        "subject": "The Pod Fields stretching to infinity. Millions of human bodies suspended in red organic pods, connected by cables and tubes, harvested for bio-energy by the machines. Horrifying industrial scale. REAL WORLD.",
        "setting": "The Power Plant pod fields. Towering organic towers covered in pods, each containing a sleeping human. Red organic glow. Machines tending the crop.",
        "composition": "Vast view of endless pod towers stretching to a dark horizon. Lightning crackling in the scorched sky. A harvester machine moving between the towers. Scale emphasizes the horror.",
        "lighting": "Sickly red organic glow from the pods. Dark oppressive sky with occasional lightning. The glow of harvested bio-electricity.",
        "artStyle": "Nightmarish industrial horror. The true face of the Matrix's power source."
    },
    {
        "id": "U061",
        "subject": "A Zion munitions specialist handing out rugged rifles and gear to a line of citizens and recruits.",
        "setting": "A Zion armory or hallway. Racks of guns and crates of ammunition line the rough stone walls.",
        "composition": "THE ARMORY LINE. In the foreground, the specialist is handing a rifle to a person. A line of other people waiting their turn stretches into the background.",
        "sunglasses": false
    }
]