"## 0. Design Notes\n\nThis set was designed with the help of Gemini and Claude. While I designed the mechanics and the initial cards, they helped fill out the file, create the art, and create the website. Final polishing, ensuring the set makes sense, and making the cards flavorful and fun has been done by hand.\n\nI'm aiming to make this a good limited environment over anything. That means that though the mechanics are quite parasitic, they should work in the context its meant to be played. If some cards play weirdly outside the set, that's okay, as it's not optimized for it.\n\nTo represent the different worlds, I repurposed Shadow as Digital. While Shadow is a bit of a dud mechanic, I feel like with a stronger thematic focus, it can be a useful tool for this set.\n\nBy trying to split it along color lines, it makes the digital world as relevant as the non-digital world. This requires each color to have the tools to interact with each world, so the colors break down as such:\n\nW: The in-between color. Represents the order of the The Matrix and the human community of the real world. Eject/Jack-In lets it engage in both with a single card.\n\nU: The logic and order of the matrix. It gets down to the very structure of it, and also the humans that can interact with it. Mostly digital, with classic blue control tools.\n\nB: The agents and manipulators of the world are in Black. Mostly, but not entirely, digital, it also includes much of the real world machine army.\n\nR: Represents the raw passion of the human resistance and the explosive, physical nature of the Real World. It interacts with the Digital world through disruption—using \"EMP\" effects and direct damage to \"burn out\" programs and artifacts.\n\nG: Green represents the \"fields\" of the Machine City and the organic endurance of Zion. It generates and stores the most energy and mostly only interacts with the digital world through interaction and \"digital reach\".\n\nEnergy is an important component of the set. Fundamental to The Matrix universe, here we try to explore some new design space. Cards that are spenders but not generators, classic engine pieces, and energy threshold cards make it fundamental to playing this set.\n\n## Draft Archetypes:\n\n**WU: System Infiltration**\n\nThis archetype focuses on the Jack-in and Eject mechanics to gain value from transitioning between the Real World and the Matrix, allowing a flexible approach to both offense and defense.\n\n**UB: Agent Control & Infiltration**\n\nA control shell that utilizes Digital creatures and the Champion mechanic to possess and neutralize opponent threats. It relies on evasive creatures with \"saboteur\" abilities (triggers on combat damage) to generate card advantage and disrupt the opponent's hand.\n\n**BR: Sentinel Aggro**\n\nAn aggressive artifact-centric deck that focuses on Robot tribal to push through. It rewards you for sacrificing artifacts for value and using Energy to burn out opponents.\n\n**RG: Bio-Electric Power**\n\nThis deck focuses on generating large amounts of Energy {E} and spending it on massive \"Real World\" threats like Beasts and Vehicles. It aims to overwhelm the board with high-power creatures and trampling damage.\n\n**GW: Zion Resistance**\n\nA \"go-wide\" strategy that boosts Non-Digital (Human) creatures. It utilizes Vigilance and \"affinity for humans\" to stabilize the board and punish the Machines with overwhelming numbers.\n\n**WB: Lifedrain Syndicate**\n\nThis archetype revolves around an attrition-based strategy centered on the Merovingian's network of Programs. It uses lifegain and death triggers to generate value, draining opponents while building card advantage through Treasure and sacrifice synergies.\n\n**UR: Code Modification**\n\nA spells-matter and high-tech deck that uses Energy to power your spells or pay off casting them. It features Humans and Programs that grow or trigger abilities whenever you cast noncreature spells.\n\n**BG: Harvester Operations**\n\nThis archetype focuses on the graveyard and the recycling of resources. It uses Robot and Ooze creatures to gain value from death triggers and spends Energy to return threats to the battlefield.\n\n**RW: Armed and Ready**\n\nThe premier \"Guns\" deck. It leverages Gun tokens and aggressive creatures to create a highly efficient, fast-moving combat force that rewards aggressive play.\n\n**GU: System Mastery**\n\nA midrange deck that uses Energy and flash threats to manipulate the battlefield and protect its creatures. It's a reactive value town."